package org.example.task1;

// Создайте 10 потоков, каждый из которых «делает вычисления» (генерирует случайное
// число, ждёт сгенерированное число миллисекунд, добавляет сгенерированное число в
// общую для всех потоков переменную). Используя AtomicBoolean, создайте флаг,
// указывающий на возможность завершения приложения. Когда потоки накопят в общей
// переменной число 1_000_000 флаг становится true

public class CalculationThreads {
    public static void main(String[] args) {

        

    }
}